{
  "title": "Companion Card Application: Complete Guide for Every Australian State (2025)",
  "slug": "companion-card-application-australia-guide",
  "date": "2025-12-16",
  "description": "Everything you need to know about applying for a Companion Card in Australia. Step-by-step application guides for NSW, Victoria, Queensland, and all other states, including eligibility requirements, required documents, and where to use your card.",
  "content": "<h2>What is a Companion Card?</h2><p>A Companion Card is a nationally recognised card that allows people with significant and permanent disabilities to bring a companion or carer to venues and events <strong>free of charge</strong>. Instead of paying for two tickets, you pay for one—your companion gets in free.</p><p>The program recognises that some people with disability require attendant care support to participate in community activities, and that the cost of a second ticket shouldn't be a barrier to participation. Over <strong>4,200 businesses and organisations</strong> across Australia accept the Companion Card, including cinemas, sporting venues, theatres, museums, zoos, and public transport services.</p><h2>Who is Eligible for a Companion Card?</h2><p>To be eligible for a Companion Card in any Australian state or territory, you must meet the following criteria:</p><h3>Core Eligibility Requirements</h3><ol><li><strong>Australian Residency</strong>: You must be a permanent Australian citizen or resident</li><li><strong>Significant and Permanent Disability</strong>: You must have a significant disability that is permanent (lifelong)</li><li><strong>High Level of Support Needs</strong>: Your disability must require a high level of ongoing attendant care support to participate in community activities</li><li><strong>Lifelong Need</strong>: The need for attendant care support must be lifelong—not temporary or related to a condition that may improve</li></ol><p><strong>Important:</strong> NDIS eligibility does not guarantee Companion Card eligibility. The program is not income-tested—your eligibility is based purely on your support needs.</p><h2>How to Apply: State-by-State Guide</h2><h3>New South Wales (NSW)</h3><p><strong>Phone:</strong> 1800 893 044</p><p><strong>Processing Time:</strong> Up to 12 weeks</p><p>Visit Service NSW online to complete your application with supporting documentation.</p><h3>Victoria (VIC)</h3><p><strong>Phone:</strong> 1800 650 611</p><p><strong>Processing Time:</strong> Minimum 8 weeks</p><p>Apply online or download a hard copy form. Part A is completed by you, Part B by your health professional.</p><h3>Queensland (QLD)</h3><p><strong>Phone:</strong> 13 QGOV (13 74 68)</p><p><strong>Processing Time:</strong> 4-6 weeks</p><p>Complete the online application form on the Queensland Government website.</p><h3>South Australia (SA)</h3><p><strong>Phone:</strong> 1800 667 110</p><h3>Western Australia (WA)</h3><p><strong>Phone:</strong> 1800 617 337</p><h3>Australian Capital Territory (ACT)</h3><p><strong>Phone:</strong> (02) 6205 4333</p><h3>Tasmania (TAS)</h3><p><strong>Phone:</strong> 1800 009 501</p><h3>Northern Territory (NT)</h3><p><strong>Phone:</strong> (08) 8948 5400</p><h2>Required Documents</h2><ul><li><strong>Completed Application Form</strong> (Part A by you, Part B by health professional)</li><li><strong>Two passport-sized photographs</strong> (signed on back by health professional)</li><li><strong>Proof of identity</strong> (driver's licence, passport, Medicare card)</li><li><strong>Proof of residency</strong></li><li><strong>Supporting medical documentation</strong> (Functional Capacity Assessments, diagnostic reports, therapy reports)</li></ul><h3>Who Can Complete the Health Professional Section?</h3><p>GP, Medical Specialist, Occupational Therapist, Physiotherapist, Psychologist, Social Worker, Registered Nurse, or NDIS Support Coordinator.</p><h2>How Long is a Companion Card Valid?</h2><p>Your Companion Card is a <strong>lifelong card</strong>. Once approved, you don't need to reapply—it simply needs to be renewed every <strong>10 years</strong> to update your photograph and details.</p><h2>Where Can You Use Your Companion Card?</h2><p>The card is accepted at over 4,200 venues including:</p><ul><li>Cinemas, theatres, and concert venues</li><li>Museums, galleries, and zoos</li><li>Sporting venues (AFL, NRL, cricket)</li><li>Public transport (buses, trains, ferries)</li><li>Theme parks and tourist attractions</li><li>Swimming pools and fitness centres</li></ul><p>Your card is recognised <strong>nationally</strong>, so you can use it when travelling interstate.</p><h2>Companion Card vs NDIS</h2><p>The Companion Card and NDIS serve different purposes. The Companion Card provides free entry for companions at venues, while the NDIS provides funding for disability supports and services. <strong>You can have both!</strong> Having one doesn't affect your eligibility for the other.</p><h2>Tips for a Successful Application</h2><ol><li>Be detailed about your support needs</li><li>Choose a health professional who knows your condition well</li><li>Gather strong supporting documentation</li><li>Don't assume NDIS means automatic approval</li><li>Apply before you need it (processing takes 4-12 weeks)</li></ol>",
  "image": "/assets/downs.webp",
  "readTime": "15 min read"
}
