{
  "title": "Home Care Package Changes: The New Support at Home Program",
  "slug": "home-care-package-changes-the-new-support-at-home-program",
  "date": "2025-03-09",
  "description": "No summary available",
  "content": "<h2 id=\"\">Key Points</h2><ul id=\"\"><li id=\"\">The Support at Home program, starting July 1, 2025, replaces existing in-home aged care programs to help older Australians live independently longer.</li><li id=\"\">It seems likely that the program will simplify access with a Single Assessment System and offer flexible services like clinical care, independence support, and home modifications.</li><li id=\"\">Research suggests contributions will vary based on means testing, with no charge for clinical services and lower fees for Commonwealth Seniors Health Card holders.</li><li id=\"\">The evidence leans toward current Home Care Package holders transitioning smoothly, with no new assessments needed unless needs change.</li></ul><h2 id=\"\">Introduction</h2><p id=\"\">The Support at Home program is a major reform in Australia's aged care system, designed to enhance in-home care for older people. Set to launch on July 1, 2025, it will replace the Home Care Packages Program and Short-Term Restorative Care Programme, with the Commonwealth Home Support Programme transitioning no earlier than July 1, 2027. This initiative aims to make care more accessible and equitable, responding to recommendations from the Royal Commission into Aged Care Quality and Safety.</p><h2 id=\"\">Key Features and Services</h2><p id=\"\">The program offers a range of services to support independence, including:</p><ul id=\"\"><li id=\"\"><strong id=\"\">Clinical care</strong>: Nursing, occupational therapy, and continence care, with no financial contribution required.</li><li id=\"\"><strong id=\"\">Independence services</strong>: Help with daily tasks like showering and medication, with moderate contributions.</li><li id=\"\"><strong id=\"\">Everyday living services</strong>: Cleaning, gardening, and meal prep, which may incur higher contributions.</li></ul><p id=\"\">It includes special pathways like the Restorative Care Pathway (up to 12 weeks, extra budget ~$6,000 for allied health) and the Assistive Technology and Home Modifications (AT-HM) Scheme (up to $15,000 for modifications, funding tiers from $500 to $15,000).</p><h2 id=\"\">Financial Contributions</h2><p id=\"\">Contributions are means-tested based on the Age Pension, with exemptions for clinical services. Holders of the Commonwealth Seniors Health Card may pay less. The \"No Worse Off Principle\" ensures current recipients assessed by September 12, 2024, won't face higher costs and can access residential care under current fees.</p><h2 id=\"\">Accessing the Program</h2><p id=\"\">Older Australians can apply through <a href=\"https://www.myagedcare.gov.au/help-at-home\" id=\"\">My Aged Care</a> online or by calling 1800 200 422. Assessments use the Single Assessment System, typically conducted at home.</p><h2 id=\"\">Program Overview and Purpose</h2><p id=\"\">The Support at Home program is designed to reform in-home aged care, replacing the Home Care Packages Program and Short-Term Restorative Care Programme from July 1, 2025, with the Commonwealth Home Support Programme transitioning no earlier than July 1, 2027. This initiative responds to the Royal Commission into Aged Care Quality and Safety, aiming to create a simpler, more equitable system that helps older people live independently at home for longer. It addresses previous complexities in the aged care system, such as long wait times for Home Care Packages and varying service availability under the Commonwealth Home Support Programme.</p><p id=\"\">The program's vision is to ensure improved access to services, equipment, and home modifications, promoting health, activity, and social connection within the community. It consolidates multiple programs into a single model, reducing administrative burden and confusion for users.</p><h2 id=\"\">Key Features</h2><p id=\"\">The Support at Home program introduces several innovative features to meet diverse needs:</p><ul id=\"\"><li id=\"\"><strong id=\"\">Restorative Care Pathway</strong>: This pathway offers up to 12 weeks of support, with an additional budget of approximately $6,000, which can increase to $12,000 if required, focusing on allied health services to enhance independence.</li><li id=\"\"><strong id=\"\">Assistive Technology and Home Modifications (AT-HM) Scheme</strong>: Provides funding for home modifications (up to $15,000) and assistive technology (up to $15,000, with higher amounts possible based on evidence). Funding is tiered: Low ($500), Medium ($2,000), and High ($15,000), ensuring tailored support for individual needs.</li><li id=\"\"><strong id=\"\">End-of-Life Pathway</strong>: Offers up to $25,000 over 3 months, with 16 weeks to utilize the funds, specifically for the last 3 months of life to ensure comfort and dignity.</li></ul><p id=\"\">These features aim to provide upfront supports and early interventions, addressing gaps in the current system and supporting higher levels of care for those with complex needs.</p><h2 id=\"\">Services Provided</h2><p id=\"\">The program categorizes services into three main areas, each designed to support different aspects of daily living:</p><ul id=\"\"><li id=\"\"><strong id=\"\">Clinical Care</strong>: Includes nursing, occupational therapy, and continence care, with no financial contribution required, ensuring essential health services are accessible.</li><li id=\"\"><strong id=\"\">Independence Services</strong>: Covers assistance with personal tasks such as showering, dressing, medication management, transport, and respite care, with moderate contributions expected.</li><li id=\"\"><strong id=\"\">Everyday Living Services</strong>: Encompasses cleaning, gardening, shopping, and meal preparation, which may incur higher contributions due to their non-clinical nature.</li></ul><p id=\"\">The program operates with 8 ongoing service classifications, each assigned a quarterly budget. A notable aspect is the allocation of 10% of each quarterly budget for care management, applicable even to self-managed arrangements, ensuring coordinated and effective care delivery.</p><h2 id=\"\">Financial Contributions and the \"No Worse Off Principle\"</h2><p id=\"\">Financial contributions are means-tested based on the Age Pension, ensuring fairness and accessibility. The structure is as follows:</p><div data-rt-embed-type='true'><table style=\"border-collapse: collapse; width: 100%\"><tr><th style=\"border: 1px solid; padding: 8px; text-align: left; background-color: #f2f2f2\">Service Type</th><th style=\"border: 1px solid; padding: 8px; text-align: left; background-color: #f2f2f2\">Contribution Level</th></tr><tr><td style=\"border: 1px solid; padding: 8px\">Clinical Support Services</td><td style=\"border: 1px solid; padding: 8px\">No contribution</td></tr><tr><td style=\"border: 1px solid; padding: 8px\">Independence Services</td><td style=\"border: 1px solid; padding: 8px\">Moderate contribution</td></tr><tr><td style=\"border: 1px solid; padding: 8px\">AT-HM Products/Equipment</td><td style=\"border: 1px solid; padding: 8px\">Moderate contribution</td></tr><tr><td style=\"border: 1px solid; padding: 8px\">Everyday Living Services</td><td style=\"border: 1px solid; padding: 8px\">Higher contribution</td></tr></table></div><p id=\"\">Holders of the Commonwealth Seniors Health Card benefit from lower contributions, aligning with government efforts to support vulnerable groups. The \"No Worse Off Principle\" is a critical safeguard, ensuring that individuals on Home Care Packages, the National Priority System, or assessed eligible by September 12, 2024, will not face increased financial contributions. Additionally, they can enter residential care under the current fee system, providing continuity and protection.</p><h2 id=\"\">Accessing the Program</h2><p id=\"\">Access to the Support at Home program is facilitated through <a href=\"https://www.myagedcare.gov.au/help-at-home\" id=\"\">My Aged Care</a>, with options to apply online or by calling 1800 200 422. The assessment process uses the Single Assessment System, typically conducted in person at the individual's home, ensuring a personalized evaluation of needs. This streamlined approach aims to simplify entry into the program, reducing barriers for older Australians.</p><h2 id=\"\">Transition Arrangements</h2><p id=\"\">For current recipients, the transition to Support at Home is designed to be seamless:</p><ul id=\"\"><li id=\"\">Home Care Package holders will transition to Support at Home at their current service levels, with no new assessment required unless their needs change.</li><li id=\"\">Individuals on the National Priority System awaiting allocation will automatically transition to a Support at Home classification once a place is available, maintaining continuity.</li><li id=\"\">The Commonwealth Home Support Programme will continue as a separate program until no earlier than July 1, 2027, ensuring existing clients are not disrupted during the transition period.</li></ul><p id=\"\">These arrangements reflect the government's commitment to minimizing disruption and ensuring readiness across the sector, with resources like the Support at Home Program Provider Transition Guide available for providers.</p><h2 id=\"\">Funding Model and Equity</h2><p id=\"\">The program moves to a fee-for-service funding model, with payments based on agreed prices for services delivered, eliminating the accrual of unspent funds. This shift aims to improve efficiency and ensure resources are utilized effectively. To address service availability, especially in regional, rural, and remote areas, a grant program supports providers, ensuring equitable access for all seniors, including those with unique needs like dementia support and cultural safety for Aboriginal and Torres Strait Islander people.</p><h2 id=\"\">Frequently Asked Questions</h2><p id=\"\">To address common queries, here are some key points:</p><ul id=\"\"><li id=\"\"><strong id=\"\">When does the program start?</strong> July 1, 2025, for Home Care Packages and Short-Term Restorative Care, with Commonwealth Home Support Programme transitioning no earlier than July 1, 2027.</li><li id=\"\"><strong id=\"\">How does funding work?</strong> On a fee-for-service basis, with quarterly budgets and no accrual of unspent funds, ensuring transparency and efficiency.</li><li id=\"\"><strong id=\"\">What happens to my current care arrangement?</strong> Current recipients will transition smoothly, with the \"No Worse Off Principle\" protecting financial contributions and service levels.</li></ul><h2 id=\"\">Resources and Further Information</h2><p id=\"\">For additional details, refer to the following official resources:</p><ul id=\"\"><li id=\"\"><a href=\"https://www.health.gov.au/sites/default/files/2024-10/support-at-home-program-handbook.pdf\" id=\"\">Support at Home program handbook</a></li><li id=\"\"><a href=\"https://www.health.gov.au/sites/default/files/2024-12/support-at-home-program-booklet-for-older-people-families-and-carers.pdf\" id=\"\">Support at Home program – Booklet for older people, families and carers</a></li><li id=\"\"><a href=\"https://www.myagedcare.gov.au/help-at-home\" id=\"\">My Aged Care help at home services</a></li><li id=\"\"><a href=\"https://www.health.gov.au/our-work/support-at-home/features\" id=\"\">Features of the new Support at Home program</a></li></ul><h2 id=\"\">Key Citations</h2><ul id=\"\"><li id=\"\"><a href=\"https://www.health.gov.au/sites/default/files/2024-10/support-at-home-program-handbook.pdf\" id=\"\">Support at Home program handbook Australian Government Department of Health and Aged Care</a></li><li id=\"\"><a href=\"https://www.health.gov.au/sites/default/files/2024-12/support-at-home-program-booklet-for-older-people-families-and-carers.pdf\" id=\"\">Support at Home program – Booklet for older people, families and carers Australian Government Department of Health and Aged Care</a></li><li id=\"\"><a href=\"https://www.myagedcare.gov.au/help-at-home\" id=\"\">My Aged Care help at home services Australian Government</a></li><li id=\"\"><a href=\"https://www.health.gov.au/our-work/support-at-home/features\">Features of the new Support at Home program Australian Government Department of Health and Aged Care</a></li></ul>",
  "image": "/assets/Doing Dishes.webp",
  "readTime": "7 min read"
}