{
  "title": "NDIS News: Latest Updates, Changes & What Participants Need to Know (December 2025)",
  "slug": "ndis-news-latest-updates-australia-2025",
  "date": "2025-12-16",
  "description": "Stay informed with the latest NDIS news and updates for December 2025. Comprehensive coverage of pricing changes, support list rules, the new PACE system, planning framework updates, and what these changes mean for participants and families.",
  "content": "<h2>Introduction: Staying Informed About NDIS Changes</h2><p>The National Disability Insurance Scheme (NDIS) continues to evolve, with significant changes rolling out throughout 2025 that affect how participants access supports, manage their plans, and work with providers. Whether you're a current NDIS participant, a family member supporting someone on the scheme, or considering applying for the first time, staying up-to-date with the latest NDIS news is essential for making the most of your funding and navigating the system effectively.</p><p>This comprehensive guide covers all the major NDIS updates and changes as of December 2025, explaining what they mean in practical terms and how you can adapt to ensure you continue receiving the support you need.</p><h2>Major NDIS Changes in 2025: A Complete Overview</h2><p>2025 has been a year of substantial reform for the NDIS. The government has introduced changes aimed at making the scheme more sustainable, fairer, and easier to navigate. Here's what's changed and what it means for you.</p><h3>The NDIS Support Lists Transition Has Ended</h3><p>One of the most significant changes affecting participants is the end of the 12-month transition period for the NDIS Support Lists, which concluded on <strong>2 October 2025</strong>.</p><p><strong>What changed:</strong></p><ul><li>Since October 2024, the NDIA introduced formal Support Lists that clearly define what can and cannot be purchased with NDIS funding</li><li>Supports are now separated into two categories: those that are NDIS supports (can be purchased) and those that are not (cannot be purchased)</li><li>During the transition period, the NDIA didn't raise debts for first or second purchases of non-NDIS supports under $1,500</li></ul><p><strong>What this means now:</strong></p><ul><li>From 3 October 2025, debts may be raised for any purchase that isn't on the approved NDIS supports list, regardless of the amount</li><li>All claims must use updated support item codes—legacy item numbers are no longer accepted</li><li>Participants should review their current supports to ensure everything aligns with the new lists</li></ul><p><strong>Action required:</strong> If you're unsure whether your supports comply with the new rules, speak with your Support Coordinator or Plan Manager. They can help check your supports and ensure your funding is used correctly.</p><h3>New NDIS Pricing Arrangements 2025-26</h3><p>The NDIA released updated Pricing Arrangements and Price Limits that came into effect on <strong>1 July 2025</strong>, with additional updates from <strong>24 November 2025</strong>.</p><p><strong>Key pricing changes include:</strong></p><p><strong>Therapy Rate Adjustments:</strong></p><ul><li>Psychology and physiotherapy now have standardised national pricing, replacing the previous state-by-state system</li><li>Psychology rates increased by approximately $10 in NSW, VIC, and QLD, while decreasing by around $11 in other states</li><li>Physiotherapy prices decreased by $10 in eastern states, with larger reductions (up to 18%) elsewhere</li><li>Dietetics and podiatry prices decreased by 2.6% nationally</li><li>Art and music therapy rates changed to $156.16 per hour (down from $193.99) from 24 November 2025</li></ul><p><strong>Core Support Increases:</strong></p><ul><li>Most core supports saw price increases of approximately 3.95%, reflecting the 3.5% wage increase and 0.5% superannuation increase</li></ul><p><strong>Support Coordination Changes:</strong></p><ul><li>Level 1 Support Connection increased by 3.95%</li><li>Level 2 and 3 Support Coordination price limits were frozen</li><li>Plan Management monthly fees were frozen, and the one-off establishment fee was removed for new plans starting 1 July 2025</li></ul><p><strong>Travel Billing Restrictions:</strong></p><ul><li>Therapists can now only bill travel time at 50% of their hourly rate</li><li>Maximum billable travel time remains 30 minutes in metropolitan areas and 60 minutes in remote areas</li></ul><h3>The New PACE System</h3><p>If you've recently had a plan reassessment or are new to the NDIS, you're likely using the <strong>PACE system</strong> (Participant and Claims Enhancement). This is the NDIA's new computer system for managing plans.</p><p><strong>What's different with PACE:</strong></p><p><strong>Provider Endorsement:</strong></p><ul><li>Instead of creating individual service bookings, you now \"endorse\" providers through the portal</li><li>You can add or remove endorsed providers at any time</li><li>If you can't access the portal, your Support Coordinator, nominee, or the NDIS helpline (1800 800 110) can help</li></ul><p><strong>Budget Display:</strong></p><ul><li>Your plan budget may appear differently in the portal</li><li>Funding is now displayed according to the new support categories</li></ul><h3>New Funding Periods</h3><p>From <strong>19 May 2025</strong>, the NDIS introduced new funding periods—smaller, more regular payment cycles across the life of your plan.</p><p><strong>How it works:</strong></p><ul><li>Most funding periods are set to three months</li><li>This helps participants manage their budget more consistently</li><li>You won't receive access to your full annual budget all at once</li><li>Changes are being rolled out gradually as participants receive new or reassessed plans</li></ul><p><strong>Benefits:</strong></p><ul><li>Better budget management throughout your plan</li><li>Reduced risk of running out of funds before your plan ends</li><li>More flexibility to adjust spending as needed</li></ul><h3>Impairment Notices From January 2025</h3><p>From <strong>1 January 2025</strong>, all new NDIS participants receive an <strong>impairment notice</strong> instead of the previous access decision letter.</p><p><strong>What's included:</strong></p><ul><li>Confirmation of your access pathway (disability or early intervention)</li><li>Your categories of impairment</li><li>This information helps planners determine what supports are funded</li></ul><p><strong>For existing participants:</strong> You'll receive an impairment notice when you move to a new plan.</p><h3>Claims Deadline: Two-Year Rule</h3><p>Since October 2024, all claims for payment must be submitted within <strong>two years</strong> of the support start date.</p><p><strong>What this means:</strong></p><ul><li>Keep closer track of invoices, receipts, and payment requests</li><li>Don't delay submitting claims for services you've received</li><li>Set up a system to track outstanding invoices</li></ul><h2>Upcoming NDIS Changes: What's on the Horizon</h2><h3>New Planning Framework (Mid-2026)</h3><p>The NDIA originally planned to introduce a new planning process in September 2025 but has delayed implementation to <strong>mid-2026</strong> following feedback from the disability community.</p><p><strong>What we know:</strong></p><ul><li>The new approach is called \"new framework planning\"</li><li>It aims to make planning fairer, more consistent, and easier for participants</li><li>A new needs assessment tool called <strong>I-CAN</strong> (Instrument for Classification and Assessment of Support Needs) will be used for participants aged 16 and over</li><li>Changes will be rolled out gradually</li></ul><h3>NDIS Amendment (Integrity and Safeguarding) Bill 2025</h3><p>On 11 November 2025, Minister McAllister announced the second tranche of legislative reforms to the NDIS. These changes focus on improving the quality of care and safety for all NDIS participants.</p><h3>Early Childhood Approach Expansion</h3><p>The early childhood approach now covers children up to <strong>9 years old</strong> (previously 7 years old), providing earlier intervention support for more young Australians with developmental delays or disabilities.</p><h2>NDIS Financial Update: Scheme Sustainability</h2><p>The NDIS Quarterly Report (March 2025) shows positive progress on scheme sustainability:</p><ul><li>Scheme expenses for the first nine months of 2024-25 were $34.2 billion—$740 million lower than projected</li><li>Annual cost growth at the end of March was 10.6%</li><li>The scheme is on track to achieve the financial stabilisation target of 8% growth by 1 July 2026</li></ul><p>The pricing adjustments throughout 2025, particularly for therapies, are part of broader efforts to ensure participants are charged fairly and consistently with what other Australians pay through Medicare or Private Health Insurance.</p><h2>What These Changes Mean for NDIS Participants</h2><h3>Review Your Current Plan</h3><p>With so many changes taking effect, now is a good time to:</p><ol><li><strong>Check your supports</strong> against the new NDIS Support Lists</li><li><strong>Understand your funding periods</strong> and budget cycles</li><li><strong>Ensure your providers are endorsed</strong> in the PACE system</li><li><strong>Update your records</strong> for any outstanding claims</li></ol><h3>Know Your Rights</h3><ul><li>You can request a plan variation or reassessment at any time</li><li>If someone from the NDIS calls unexpectedly about your plan, you can ask to reschedule with a support person present</li><li>You have the right to request a review if you believe your plan was changed unfairly</li></ul><h3>Get Support</h3><p>If you're feeling overwhelmed by the changes, you're not alone. Support Coordinators, Plan Managers, and organisations like MD Home Care can help you navigate the new landscape.</p><h2>How MD Home Care Can Help</h2><p>At MD Home Care, we stay across all NDIS updates so you don't have to. Our experienced team can help you:</p><ul><li><strong>Understand how changes affect your plan</strong> and the supports you receive</li><li><strong>Navigate the new PACE system</strong> and provider endorsement process</li><li><strong>Maximise your funding</strong> within the updated pricing arrangements</li><li><strong>Connect with quality support workers</strong> who meet your needs</li><li><strong>Manage your plan</strong> efficiently with our Support Coordination services</li></ul><p>With over 10 years of experience supporting NDIS participants across Sydney and Melbourne, we're committed to helping you achieve your goals while adapting to scheme changes.</p><h2>Frequently Asked Questions</h2><h3>What is the biggest NDIS change in 2025?</h3><p>The end of the Support Lists transition period on 2 October 2025 is one of the most significant changes. This means the NDIA can now raise debts for purchases that aren't approved NDIS supports, regardless of the amount.</p><h3>Are NDIS prices going up or down in 2025-26?</h3><p>It depends on the service. Core supports increased by approximately 3.95%, while many therapy services saw price reductions as part of efforts to align NDIS pricing with Medicare rates. Art and music therapy rates decreased from $193.99 to $156.16 per hour.</p><h3>What is the PACE system?</h3><p>PACE (Participant and Claims Enhancement) is the NDIA's new computer system for managing NDIS plans. It introduces changes like provider endorsement (instead of service bookings) and displays budgets according to updated support categories.</p><h3>When is the new NDIS planning framework starting?</h3><p>The new planning framework is now expected to begin in mid-2026, delayed from the original September 2025 date. It will include a new needs assessment tool called I-CAN for participants aged 16 and over.</p><h3>Can I still use my NDIS funding for the same things?</h3><p>You must ensure your purchases align with the official NDIS Support Lists. If you've been buying items that aren't on the approved list, you may need to find alternative supports or discuss the replacement support rule with your planner.</p><h3>What should I do if I'm confused about the changes?</h3><p>Contact your Support Coordinator, Plan Manager, or a trusted NDIS provider like MD Home Care. They can review your plan, explain how changes affect you, and help you adjust your supports accordingly.</p><h2>Conclusion: Staying Ahead of NDIS Changes</h2><p>The NDIS landscape continues to shift as the scheme matures and responds to sustainability challenges. While change can feel overwhelming, staying informed empowers you to make the most of your funding and advocate for the supports you need.</p><p>The key changes to remember:</p><ul><li><strong>Support Lists are now fully enforced</strong>—ensure your purchases comply</li><li><strong>Pricing has changed</strong> for many services, particularly therapies</li><li><strong>The PACE system</strong> is now standard for new and reassessed plans</li><li><strong>Funding periods</strong> are shorter, helping with budget management</li><li><strong>New planning framework</strong> is coming in mid-2026</li></ul><p>By staying informed and working with knowledgeable providers, you can navigate these changes confidently and continue building the life you want with NDIS support.</p><p><em>This article was last updated on 16 December 2025. NDIS rules and pricing are subject to change. Always check the official NDIS website or speak with your Support Coordinator for the most current information.</em></p>",
  "image": "/assets/disabled carer.webp",
  "readTime": "12 min read"
}
