[
  {
    "title": "Companion Card Application: Complete Guide for Every Australian State (2025)",
    "slug": "companion-card-application-australia-guide",
    "date": "2025-12-16",
    "description": "Everything you need to know about applying for a Companion Card in Australia. Step-by-step application guides for NSW, Victoria, Queensland, and all other states, including eligibility requirements, required documents, and where to use your card.",
    "image": "/assets/downs.webp",
    "readTime": "15 min read"
  },
  {
    "title": "Hireup Support Worker Rates 2025: Complete Pay & Pricing Guide for Workers and Clients",
    "slug": "hireup-support-worker-rates-guide-2025",
    "date": "2025-12-16",
    "description": "Comprehensive guide to Hireup support worker rates in 2025. Detailed breakdown of hourly pay rates for workers, client pricing, weekend and public holiday rates, how Hireup compares to other NDIS platforms, and what to consider when choosing a provider.",
    "image": "/assets/carer.webp",
    "readTime": "12 min read"
  },
  {
    "title": "NDIS News: Latest Updates, Changes & What Participants Need to Know (December 2025)",
    "slug": "ndis-news-latest-updates-australia-2025",
    "date": "2025-12-16",
    "description": "Stay informed with the latest NDIS news and updates for December 2025. Comprehensive coverage of pricing changes, support list rules, the new PACE system, planning framework updates, and what these changes mean for participants and families.",
    "image": "/assets/disabled carer.webp",
    "readTime": "12 min read"
  },
  {
    "title": "Self-Managed Home Care Packages in Australia: The Complete Guide (2025)",
    "slug": "self-managed-home-care-packages-australia",
    "date": "2025-06-01",
    "description": "A comprehensive guide to self-managing Home Care Packages in Australia, including benefits, responsibilities, provider selection, and practical tips for maximizing control and value from your aged care funding.",
    "image": "/assets/holdinglinen.webp",
    "readTime": "35 min read"
  },
  {
    "title": "NDIS Core Supports Explained: Your Ultimate Guide to Funding, Categories & Examples (2025 Update)",
    "slug": "ndis-core-supports",
    "date": "2025-05-10",
    "description": "Comprehensive guide to understanding NDIS Core Supports funding, including the four categories, flexibility rules, budget management, and practical examples to help participants maximize their NDIS plans in 2025.",
    "image": "/assets/disabled carer.webp",
    "readTime": "25 min read"
  },
  {
    "title": "Understanding Your Care Options: Palliative Care vs. Hospice Care in Australia",
    "slug": "palliative-vs-hospice-care-australia",
    "date": "2024-07-26",
    "description": "Serious illness makes navigating Australia's healthcare system difficult. This article defines palliative, hospice, and end-of-life care, compares them, and explains how to access services.",
    "image": "/assets/homecare.webp",
    "readTime": "22 min read"
  },
  {
    "title": "How Much is the Disability Pension Per Fortnight? Australia's DSP Guide (2025)",
    "slug": "disability-support-pension-australia",
    "date": "2025-05-01",
    "description": "Your comprehensive guide to the Australian Disability Support Pension (DSP). Find out how much the DSP pays per fortnight, eligibility criteria, income and asset limits, and how long payments last.",
    "image": "/assets/ndis-services-intellectual-disability-2-woman-smiling-hugging.webp",
    "readTime": "12 min read"
  },
  {
    "title": "What Can I Spend My Home Care Package On? Your Ultimate 2025 Guide",
    "slug": "home-care-package-spending-guide",
    "date": "2025-04-25",
    "description": "Confused about what your Home Care Package funds can cover? Get clear answers on approved services, items, and exclusions in 2025. Maximize your support today!",
    "image": "/assets/homecare.webp",
    "readTime": "10 min read"
  },
  {
    "title": "Selling Deceased Estate Property in Australia: The Ultimate Guide (2025 Update)",
    "slug": "selling-deceased-estate-property-australia",
    "date": "2025-04-22",
    "description": "A comprehensive guide to navigating the legal, financial, and emotional aspects of selling property from a deceased estate in Australia, covering probate requirements, tax implications, and state-specific considerations.",
    "image": "/assets/deceasedestate.webp",
    "readTime": "25 min read"
  },
  {
    "title": "NDIS vs NDIA",
    "slug": "ndis-vs-ndia",
    "date": "2025-04-18",
    "description": "Understand the key differences between the National Disability Insurance Scheme (NDIS) and the National Disability Insurance Agency (NDIA), including their roles, responsibilities, and how they affect disability support services in Australia.",
    "image": "https://cdn.prod.website-files.com/67ba898f18b9815458c46343/6801c4048c32ec3d75779e12_care-assure-Zx4ddAfk0Ck-unsplash.webp",
    "readTime": "11 min read"
  },
  {
    "title": "Australia's Best Activities for Seniors: Your Ultimate Guide to Fun in Sydney & Melbourne (2025)",
    "slug": "activities-for-seniors-sydney-melbourne",
    "date": "2025-04-16",
    "description": "Discover the most enjoyable and accessible activities for seniors in Sydney and Melbourne in 2025, from cultural events and social gatherings to outdoor excursions and wellness programs tailored for older adults.",
    "image": "https://cdn.prod.website-files.com/67ba898f18b9815458c46343/67fef87bdc87f90111443481_brandon-hoogenboom-GjvxL-2AgnU-unsplash.jpg",
    "readTime": "26 min read"
  },
  {
    "title": "Where can I use my Companion Card (NSW)",
    "slug": "where-can-i-use-my-companion-card-nsw",
    "date": "2025-04-15",
    "description": "A comprehensive guide to all the venues, attractions, and services across NSW that accept the Companion Card, helping people with disability to participate in recreational activities with the support of a companion.",
    "image": "https://cdn.prod.website-files.com/67ba898f18b9815458c46343/67fede722e42bd5a878ec998_cdc-F98Mv9O6LfI-unsplash.jpg",
    "readTime": "20 min read"
  },
  {
    "title": "Guide to Government-Funded Personal Alarms in Australia",
    "slug": "government-funded-personal-alarms",
    "date": "2025-03-11",
    "description": "Learn about eligibility requirements, application processes, and options for government-funded personal alarm systems that provide safety and independence for seniors and people with disability across Australia.",
    "image": "/assets/two women looking at alarm.webp",
    "readTime": "15 min read"
  },
  {
    "title": "Home Care Package Changes: The New Support at Home Program",
    "slug": "home-care-package-changes-the-new-support-at-home-program",
    "date": "2025-03-09",
    "description": "An overview of the transition from Home Care Packages to the new Support at Home Program, including key changes, implementation timeline, and how these reforms will impact care recipients and providers.",
    "image": "/assets/Doing Dishes.webp",
    "readTime": "7 min read"
  },
  {
    "title": "Home Care Package Level 2 Guide",
    "slug": "home-care-package-level-2",
    "date": "2025-03-09",
    "description": "Everything you need to know about Level 2 Home Care Packages, including services covered, funding allocation, choosing a provider, and how to make the most of your package to support independent living.",
    "image": "/assets/holdinglinen.webp",
    "readTime": "9 min read"
  },
  {
    "title": "The Comprehensive Guide to Level 3 Home Care Package in 2025",
    "slug": "level-3-home-care-package",
    "date": "2025-03-09",
    "description": "Detailed information about Level 3 Home Care Packages for 2025, covering eligible services, funding amounts, consumer contributions, and strategies to maximize your care support for higher-level needs.",
    "image": "/assets/makingbed.webp",
    "readTime": "7 min read"
  },
  {
    "title": "Top 20 NDIS Providers in Sydney",
    "slug": "top-ndis-providers-in-sydney",
    "date": "2025-03-09",
    "description": "A curated list of Sydney's most reputable NDIS providers, evaluated based on service quality, participant satisfaction, range of supports offered, and expertise in different disability areas.",
    "image": "/assets/sydney.webp",
    "readTime": "13 min read"
  },
  {
    "title": "A Guide to Improved Liveability Homes in SDA",
    "slug": "improved-liveability-sda",
    "date": "2025-03-06",
    "description": "Understand what makes a home qualify as Improved Liveability under Specialist Disability Accommodation (SDA), including design features, benefits, and how to access funding for these tailored living spaces.",
    "image": "/assets/accessible bathroom.webp",
    "readTime": "6 min read"
  },
  {
    "title": "Guide to Becoming an Independent NDIS Support Worker",
    "slug": "guide-to-becoming-an-independent-support-worker",
    "date": "2025-03-06",
    "description": "Step-by-step instructions on how to establish yourself as an independent NDIS support worker, covering registration requirements, pricing, insurance, marketing strategies, and building your client base.",
    "image": "/assets/disabled carer.webp",
    "readTime": "7 min read"
  },
  {
    "title": "How Much Does Respite Care Cost Per Day? (NDIS)",
    "slug": "how-much-does-respite-care-cost-per-day-ndis",
    "date": "2025-03-06",
    "description": "A breakdown of the daily costs associated with different types of NDIS respite care services, including in-home support, center-based options, and short-term accommodation arrangements.",
    "image": "/assets/respite care.webp",
    "readTime": "6 min read"
  },
  {
    "title": "NDIS Community Participation Guide",
    "slug": "ndis-community-participation",
    "date": "2025-03-06",
    "description": "Explore how NDIS funding can support meaningful community participation, including social activities, recreational programs, volunteering opportunities, and developing community connections.",
    "image": "/assets/downs.webp",
    "readTime": "8 min read"
  },
  {
    "title": "NDIS Price Guide 2024-2025",
    "slug": "ndis-price-guide",
    "date": "2025-03-06",
    "description": "The latest information on NDIS service pricing for 2024-2025, explaining rate changes, service categories, price limits, and how to interpret the guide to maximize your NDIS funding.",
    "image": "/assets/clinic.webp",
    "readTime": "6 min read"
  },
  {
    "title": "NDIS Respite and Short-Term Accommodation Pricing Guide 2024-25",
    "slug": "ndis-respite-sta-pricing-guide-2024-25",
    "date": "2025-03-06",
    "description": "A detailed breakdown of NDIS pricing for respite care and Short-Term Accommodation (STA) services in 2024-25, covering different support levels, provider categories, and after-hours rates.",
    "image": "/assets/grandma.webp",
    "readTime": "7 min read"
  },
  {
    "title": "NDIS Support Worker Pay Rates",
    "slug": "ndis-support-worker-pay-rates",
    "date": "2025-03-06",
    "description": "Current pay scales and salary information for NDIS support workers, including variations based on qualifications, experience levels, shift types, and specializations within the disability support sector.",
    "image": "/assets/carer.webp",
    "readTime": "6 min read"
  },
  {
    "title": "How to Apply for the NDIS: Your Complete Step-by-Step Guide",
    "slug": "apply-for-funding",
    "date": "2025-02-24",
    "description": "A comprehensive walkthrough of the NDIS application process, from checking eligibility and gathering evidence to submitting your Access Request Form and navigating the planning meeting.",
    "image": "/assets/physio.webp",
    "readTime": "7 min read"
  },
  {
    "title": "Support Worker Jobs in Sydney",
    "slug": "support-workers-in-sydney",
    "date": "2025-02-23",
    "description": "Information about career opportunities for support workers in Sydney, including role requirements, benefits, application process, and the rewarding nature of supporting people with disability.",
    "image": "https://cdn.prod.website-files.com/67ba898f18b9815458c46343/67baad9bd87ba750e0be84ae_Screenshot%202025-02-23%20at%204.08.45%E2%80%AFpm.webp",
    "readTime": "2 min read"
  },
  {
    "title": "Level 4 Home Care Package Complete Guide",
    "slug": "level-4-home-care-package",
    "date": "2025-02-23",
    "description": "An in-depth guide to the highest level of Home Care Package funding, covering the extensive range of services, specialized care options, and support available for those with high-level care needs.",
    "image": "https://cdn.prod.website-files.com/67ba898f18b9815458c46343/67baa2c6b21db79b34b31c4f_dominik-lange-VUOiQW4OeLI-unsplash.webp",
    "readTime": "6 min read"
  },
  {
    "title": "Understanding STA Meaning in NDIS: A Comprehensive Guide",
    "slug": "understanding-sta-meaning-in-ndis",
    "date": "2025-02-23",
    "description": "Everything you need to know about Short-Term Accommodation (STA) in the NDIS context, including purpose, eligibility criteria, booking processes, and how it differs from other accommodation supports.",
    "image": "https://cdn.prod.website-files.com/67ba898f18b9815458c46343/67bab1b323b017da45fe302f_dr-kanapon-phumratprapin-xOvJBvcame8-unsplash.webp",
    "readTime": "4 min read"
  }
]